<?php

return array (
  'alphabet_big' => 'ABCDEFGHIJKLMNOPQRSTUVWXYZ',
  'alphabet_big_short' => 'ABCDEFG',
  'alphabet_sm' => 'abcdefghijklmnopqrstuvwxyz',
  'brand_book_designer' => 'ブランドブックデザイナー',
  'brand_strategy_and_values' => 'ブランド戦略とバリュー',
  'clear_space' => 'クリアスペース',
  'color' => '色',
  'color_enumeration' => ':num 色',
  'color_palette' => 'カラーパレット',
  'company_values_matter' => '企業のバリューは重要です。全ての成功した企業には、従業員の目標と同様に
                                    企業の目標を達成するために、従業員を支援する一連のバリューを持っています。
                                    これらのバリューは、企業のアイデンティティの本質であり、存在意義の概略となります。企業のバリューは、
                                    運営方針であり、通常企業のミッションステートメントの中に統合されます。
                                    企業は、リーダーやマネジメントとしてでなく、チームとしてバリューを設定しなければなりません。
                                    このように行うことで、企業の誰もが仲間意識を感じることができ、軽視される存在でなく、
                                    必要とされる存在だと実感できるようになります。',
  'clear_space_text' => 'クリアスペースは、国際的なサインやアイコンの周囲にテキスト、グラフィック、
                            ボーダー、その他のロゴなどのあらゆるエレメントを含まない余白スペースです。好まれる国際的なサインに必要な最小クリアスペースは、
                            "x"または :brandアイコンの高さと幅に同値になります',
  'contents' => 'コンテンツ',
  'core_values' => 'コアバリュー',
  'golden_ratio' => '黄金比',
  'guidelines' => 'ガイドライン',
  'icon_favicon' => 'アイコン＆ファビコン',
  'icon_text' => ':brandアイコンは、:colorでのみ公式ファビコンとして使用される必要があります。
                                    ナビゲートアイコンは、Whatsapp、Facebook、LinkedInなどのソーシャルメディアで、ユーザー/企業イメージとして使用される必要があります。',
  'icons_are_the_visual' => 'アイコンは、製品、サービス、ツールのビジュアル表現です。<br>
                                    シンプルで、明るく、洗練されていて、フレンドリー。アイコンは、<br>
                                    ブランドのアイデアの軸や一部を伝えます。各アイコンは視覚的に独特な一方で、<br>
                                    全てのアイコンは一貫したラインウエイトとビジュアルスタイルを持つ必要があります。',
  'feature_icons' => '主要アイコン',
  'establishing' => '最小サイズを設定することで、ロゴのインパクトや読みやすさが
                                    アプリケーションにおいて守られます。',
  'font_family_and_weight' => 'フォントファミリー＆ウエイト',
  'in_digital_or' => 'デジタル　または',
  'in_print' => 'プリント',
  'instead_of_the_colors' => 'このページで色を参照する代わりに、上記のPANTONE® カラーを使用することができます。
                                    標準版は、現在のエディションPANTONE COLOR FORMULA GUIDEでご確認できます。
                                    このページ及びこのガイドラインで表示されている色は、PANTONE, Inc.によって精度を評価されていないため、PANTONEの基準とは一致しない場合があります。
                                    PANTONE®は、PANTONE, Inc.の登録済み商標です。',
  'integrated_into_company_mission' => '企業のミッションステートメントの中に統合されます。
                                    企業は、リーダーやマネジメントとしてでなく、チームとしてバリューを設定しなければなりません。
                                    このように行うことで、
                                    企業の誰もが仲間意識を感じることができ、軽視される存在でなく、
                                    必要とされる存在だと
                                    実感できるようになります。',
  'introduction' => 'イントロダクション',
  'logo_misuse' => 'ロゴ誤用例',
  'logo_specifications' => 'ロゴ仕様',
  'logo_versions' => 'ロゴバージョン',
  'master_and_slogan' => 'マスターブランドロゴ＆スローガン',
  'minimum_size' => '最小サイズ',
  'mission' => 'ミッション',
  'not_smaller_in_digital' => ':brandアイコンは、次より小さくなるべきではありません：',
  'note_that_by_using' => 'これらのリソースを使用することで、サービス規約に同意したことになります。また、これらのリソースの使用は、:brandエンドユーザー同意と当プライバシーポリシーにも該当する場合があります。',
  'numbers' => '1234567890',
  'numbers_and_symbols' => '0123456789!@#$%^&*',
  'our_color_palette' => 'カラーパレット',
  'our_fonts' => 'フォント',
  'our_logo' => 'ロゴ',
  'pantone' => 'Pantone',
  'primary_color' => 'プライマリカラー',
  'prop_is_absolute_fib_seq' => '比率は、完全なフィボナッチ数列です',
  'prop_linked_to_fib_seq' => '比率は、フィボナッチ数列に関連しています',
  'proportions' => '割合',
  'ratio' => '比率',
  'secondary_color' => 'セカンダリカラー',
  'the_brand_book_icon' => ':brandアイコン',
  'vision' => 'ビジョン',
  'it_is_important_that' => '私たち全員が、私たちのアイデンティティを使う方法と場面に関する基本的な理解を共有することが重要です。これらのアイデンティティの基準は、基本的な使用法をあなたに紹介することを意図しています。私たちは、ブランドと法的/ライセンス制限を尊重しながら、あらゆる媒介形式で:brandを簡単に統合できるようにしたいと考えています。',
  'it_is_important_that_appearance' => 'ロゴの外観に一貫性を保つことが重要です。ロゴは、誤って解釈されたり、
                                    修正されたり、追加されたりするべきではありません。ロゴを変更する試みはされるべきではありません。ロゴの指標、カラー、構造は、
                                    このドキュメントに示されているように維持する必要があります — 例外はありません。',
  'logo_and_icon_proportions' => 'ロゴ＆アイコン比率',
  'logo_colors' => ':brandロゴは、主に:color1と
                                    :color2を使う必要があります。ネガティブ:brandロゴは、暗い背景で、ロゴとのコントラストが大きい場合に
                                    使うことができます。<br>モノクロームバージョンロゴは、白黒で印刷される
                                    ドキュメントで使われるべきです。',
  'prop_text' => ':brandロゴは、:prop_text_small 幅のすっきりとした比率を持っています。これらの比率は
                                    厳選されたものであり、変更されるべきではありません。アイコンは、:prop_textの
                                    完璧な二乗比であり、ファビコンとしての役割も果たします。',
  'square_ratio' => '二乗比',
  'tertiary_color' => 'ターシャリカラー',
  'the_colors_selected' => ':brandサインに選ばれた色は、企業のバリューに反映します。この色は、
                                    ブランドを表現するために特別に選ばれたものであり、いかなる状況においても変更されるべきではありません。
                                    <br>印刷物では、リッチブラックは、C40 M10 Y0 K100でテキスト用に使用されるべきです。',
  'the_icon_prop' => 'アイコンは、:text_smallの完璧な二乗比であり、
                                    ファビコンとしての役割も果たします。',
  'the_logo_prop' => ':brandロゴは、:text_small幅のすっきりとした比率を持っています。
                                    これらの比率は厳選されたものであり、変更されるべきではありません。',
  'we_are_proud_logo' => '私たちは、自分たちのロゴの出来を非常に誇りに思っています。あなたのロゴも常に最高の美しさを発揮できるように、
                                    これらのガイドラインに従いましょう。',
  'welcome_to_the_officisal' => ':brandブランドとアセットの公式ブランドガイドラインへようこそ。このドキュメントは、:brandブランドを使用して、内部/外部コミュニケーションを築く担当者を教育するために作成されました。',
  '&' => '&',
  'and_it_has' => 'また、次もあります',
  'font' => 'フォント',
  'our_icon_and_favicon' => 'アイコン＆ファビコン',
  'our_secondary_font_is' => 'セカンダリフォントは',
  'the_primary_font_is' => 'プライマリフォントは',
  'we_use_count_fonts' => '{0} フォントを使いません|{1} 1つのフォントを使います|{2} 2つのフォントを使います',
  'weight' => 'ウエイト',
  'weights' => 'ウエイト',
  'intro' => 'イントロダクション',
  'brand_book' => 'ブランドブック',
  'logo' => 'ロゴ',
  'designed_by' => '設計者',
  'powered_by' => '提供元',
  'primary_font' => 'プライマリフォント',
  'secondary_font' => 'セカンダリフォント',
  'contact' => '連絡先',
  'not_smaller_in_digital_logo' => ':brandロゴは次より小さくなってはいけません',
);
