app/User.php

select count(*) as aggregate from `referrers` where `user_id` = 6 and `is_used` = 1
select count(*) as aggregate from `brandbooks` where `user_id` = 6 and `brandbooks`.`deleted_at` is null
select sum(`credits`) as aggregate from `credit_logs` where `user_id` = 6
---
    public static function get_data_for_admin( $id ) {

        return [
            'amount_spent'  => Invoice::where( 'user_id', $id )->sum( 'price' ),
            'credits_used'  => Brandbook::where( 'user_id', $id )->count(),
            'credits_total' => CreditLog::where( 'user_id', $id )->sum( 'credits' ) + 1,
            'credits_ref'   => Referrers::where( 'user_id', $id )->where( 'is_used', true )->count(),
        ];