app/Http/Controllers/WeeklyStatsController.php

select DATE(created_at) as date, count(*) as users from `users` where `created_at` >= '2024-10-08 00:00:00' and `created_at` <= '2025-02-05 06:08:08' group by `date`
---
    private function getSignedUsersByDate($start, $finish)
    {
        return \App\User::select(\DB::raw("DATE(created_at) as date, count(*) as users"))
            ->where('created_at', '>=', $start)
            ->where('created_at', '<=', $finish)
            ->groupBy('date')
            ->pluck('users', 'date')
            ->toArray();

select
DATE(created_at) as date,
count(*) as invoices,
sum(price) as invoices_sum
from `invoices` where `status` = 'paid' and `created_at` >= '2024-10-08 00:00:00' and `created_at` <= '2025-02-05 06:08:08' group by `date`
---
    private function getInvoicesByDate($start, $finish)
    {
        $data = \App\Invoice::selectRaw("
            DATE(created_at) as date,
            count(*) as invoices,
            sum(price) as invoices_sum
            ")
            ->where('status', 'paid')
            ->where('created_at', '>=', $start)
            ->where('created_at', '<=', $finish)
            ->groupBy('date')
            ->get()
            ->toArray();

select `id`, `created_at`, `status`, `pdf_link`, `completed`, `version` from `brandbooks` where `created_at` >= '2024-10-08 00:00:00' and `created_at` <= '2025-02-05 06:08:08' and `brandbooks`.`deleted_at` is null
---
    private function getBooksByDate($start, $finish)
    {
        $data = \App\Brandbook::select('id', 'created_at', 'status', 'pdf_link', 'completed', 'version', 'bb_version')
            ->where('created_at', '>=', $start)
            ->where('created_at', '<=', $finish)
            ->get();

select
id, user_id, package_id,
DATE(created_at) as date,
count(*) as new_subscriptions from `invoices` where `type` = 'package' and `status` = 'paid' and `created_at` >= '2024-10-08 00:00:00' and `created_at` <= '2025-02-05 06:08:08' group by `user_id`, `package_id` having `new_subscriptions` = 1
---
    private function getNewSubscriptionByDate($start, $finish) {
        $data = \App\Invoice::selectRaw("
            id, user_id, package_id,
            DATE(created_at) as date,
            count(*) as new_subscriptions")
            ->where('type', 'package')
            ->where('status', 'paid')
            ->where('created_at', '>=', $start)
            ->where('created_at', '<=', $finish)
            ->having('new_subscriptions', '=', 1)
            ->groupBy(['user_id', 'package_id'])
            ->get()
            ->toArray();

select
user_id, package_id,
DATE(created_at) as date,
count(*) as existing_subscriptions from `invoices` where `type` = 'package' and `status` = 'paid' and `created_at` >= '2024-10-08 00:00:00' and `created_at` <= '2025-02-05 06:08:08' and 1 = 1 group by `date`, `user_id`, `package_id`
---
    private function getExistingSubscriptionByDate($start, $finish) {
        $data = \App\Invoice::selectRaw("
            user_id, package_id,
            DATE(created_at) as date,
            count(*) as existing_subscriptions")
            ->where('type', 'package')
            ->where('status', 'paid')
            ->where('created_at', '>=', $start)
            ->where('created_at', '<=', $finish)
            ->whereNotIn('id', array_column($this->newSubscriptionsData, 'id'))
            ->groupBy(['date', 'user_id', 'package_id'])
            ->get()
            ->toArray();